package com.lianyitech.core.enmu;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

/**
 * Created by zengyuanmei on 2016/9/6.
 * 马克字段枚举 主表
 */
public enum EnumMarcInfo {
    MAC_000("000","头标区","1","","1"),
    MAC_001("001","记录标识","1","1","2"),
    MAC_005("005","处理时间","1","","2"),
    MAC_009("009","自定义号","","","3"),
    MAC_010("010","ＩＳＢＮ","1","1","3"),
    MAC_011("011","ＩＳＳＮ","","","3"),//改为了1
    MAC_013("013","ＩＳＭＮ","","","3"),
    MAC_014("014","论文标识","","","3"),
    MAC_015("015","ＩＳＲＮ","","","3"),
    MAC_020("020","国家书目","","","3"),
    MAC_021("021","版权登记","","","3"),
    MAC_022("022","政府出版","","","3"),
    MAC_040("040","ＣＯＤＥ","","","3"),
    MAC_071("071","作品号","","","3"),
    MAC_091("091","统一书号","1","","3"),
    MAC_092("092","订购号","","","3"),
    MAC_093("093","专利号","","","3"),
    MAC_094("094","标准号","","","3"),
    MAC_100("100","处理数据","1","1","3"),
    MAC_101("101","作品语种","1","","3"),
    MAC_102("102","出版国别","1","","3"),
    MAC_105("105","编码数据","1","","3"),
    MAC_106("106","形态特征","1","","3"),
    MAC_110("110","连续出版","","","3"),
    MAC_111("111","","","","3"),
    MAC_115("115","录像电影","","","3"),
    MAC_116("116","书画刻印","","","3"),
    MAC_117("117","三维实物","","","3"),
    MAC_120("120","测绘资料","","","3"),
    MAC_121("121","测绘特征","","","3"),
    MAC_122("122","文献复盖","1","","3"),
    MAC_123("123","比例坐标","","","3"),
    MAC_124("124","特殊资料","","","3"),
    MAC_125("125","录音乐谱","","","3"),
    MAC_126("126","录音资料","","","3"),
    MAC_127("127","录音乐谱","","","3"),
    MAC_128("128","音乐演奏","","","3"),
    MAC_130("130","缩微特征","","","3"),
    MAC_131("131","测绘测量","","","3"),
    MAC_135("135","电子资源","","","3"),
    MAC_140("140","古籍数据","","","3"),
    MAC_141("141","古籍复本","","","3"),
    MAC_191("191","拓片","","","3"),
    MAC_192("192","民族音乐","","","3"),
    MAC_200("200","题名责任","1","1","3"),
    MAC_205("205","版本项","1","","3"),
    MAC_206("206","测绘数据","","","3"),
    MAC_207("207","卷期编号","","","3"),
    MAC_208("208","乐谱说明","","","3"),
    MAC_210("210","出版发行","1","","3"),
    MAC_211("211","预定出版","","","3"),
    MAC_215("215","载体形态","1","","3"),
    MAC_225("225","丛编项","1","","3"),
    MAC_230("230","电子资源","","","3"),
    MAC_300("300","一般附注","1","","3"),
    MAC_301("301","标识附注","","","3"),
    MAC_302("302","编码附注","","","3"),
    MAC_303("303","著录附注","","","3"),
    MAC_304("304","题名附注","","","3"),
    MAC_305("305","版本附注","","","3"),
    MAC_306("306","出版附注","","","3"),
    MAC_307("307","载体附注","","","3"),
    MAC_308("308","丛编附注","","","3"),
    MAC_310("310","装订附注","","","3"),
    MAC_311("311","连接附注","","","3"),
    MAC_312("312","相关附注","","","3"),
    MAC_313("313","主题附注","","","3"),
    MAC_314("314","责任附注","","","3"),
    MAC_315("315","特征附注","","","3"),
    MAC_316("316","复本附注","","","3"),
    MAC_317("317","出处附注","","","3"),
    MAC_318("318","操作附注","","","3"),
    MAC_320("320","书目附注","","","3"),
    MAC_321("321","索引附注","","","3"),
    MAC_322("322","作者附注","","","3"),
    MAC_323("323","演出者注","","","3"),
    MAC_324("324","原本附注","","","3"),
    MAC_325("325","复制品注","","","3"),
    MAC_326("326","频率附注","","","3"),
    MAC_327("327","内容附注","","","3"),
    MAC_328("328","学论附注","","","3"),
    MAC_330("330","提要文摘","1","","3"),
    MAC_332("332","引文","","","3"),
    MAC_333("333","对象附注","","","3"),
    MAC_336("336","电子附注","","","3"),
    MAC_337("337","系统附注","","","3"),
    MAC_345("345","采访附注","","","3"),
    MAC_410("410","丛编","","","3"),
    MAC_411("411","附属丛编","","","3"),
    MAC_421("421","补编增刊","","","3"),
    MAC_422("422","正编正刊","","","3"),
    MAC_423("423","合订合刊","","","3"),
    MAC_430("430","继承","","","3"),
    MAC_431("431","部分继承","","","3"),
    MAC_432("432","替代","","","3"),
    MAC_433("433","部分替代","","","3"),
    MAC_434("434","吸收","","","3"),
    MAC_435("435","部分吸收","","","3"),
    MAC_436("436","合并而成","","","3"),
    MAC_437("437","分自","","","3"),
    MAC_440("440","由..继承","","","3"),
    MAC_441("441","由部分继","","","3"),
    MAC_442("442","由..替代","","","3"),
    MAC_443("443","由部分替","","","3"),
    MAC_444("444","并入","","","3"),
    MAC_445("445","部分并入","","","3"),
    MAC_446("446","分成..和","","","3"),
    MAC_447("447","与..合并","","","3"),
    MAC_448("448","改回","","","3"),
    MAC_451("451","同一版本","","","3"),
    MAC_452("452","不同版本","","","3"),
    MAC_453("453","译为","","","3"),
    MAC_454("454","译自","","","3"),
    MAC_455("455","复制自","","","3"),
    MAC_456("456","复制为","","","3"),
    MAC_461("461","总集","","","3"),
    MAC_462("462","分集","","","3"),
    MAC_463("463","单册","","","3"),
    MAC_464("464","单册分析","","","3"),
    MAC_470("470","评论作品","","","3"),
    MAC_481("481","还装订有","","","3"),
    MAC_482("482","和..装订","","","3"),
    MAC_488("488","相关作品","","","3"),
    MAC_500("500","统一题名","","","3"),
    MAC_501("501","作品统一","","","3"),
    MAC_503("503","统一惯用","","","3"),
    MAC_510("510","并列题名","","","3"),
    MAC_512("512","封面题名","","","3"),
    MAC_513("513","附加题名","","","3"),
    MAC_514("514","卷端题名","","","3"),
    MAC_515("515","逐页题名","","","3"),
    MAC_516("516","书脊题名","","","3"),
    MAC_517("517","其它题名","","","3"),
    MAC_518("518","标准题名","","","3"),
    MAC_520("520","前题名","","","3"),
    MAC_530("530","识别题名","","","3"),
    MAC_531("531","缩略题名","","","3"),
    MAC_532("532","展开题名","","","3"),
    MAC_540("540","补充题名","","","3"),
    MAC_541("541","补充翻译","","","3"),
    MAC_545("545","章节题名","","","3"),
    MAC_600("600","个人主题","","","3"),
    MAC_601("601","团体主题","","","3"),
    MAC_602("602","家族主题","","","3"),
    MAC_604("604","作者主题","","","3"),
    MAC_605("605","题名主题","","","3"),
    MAC_606("606","普通主题","1","","3"),
    MAC_607("607","地名主题","","","3"),
    MAC_608("608","特性标目","","","3"),
    MAC_610("610","非控主题","","","3"),
    MAC_615("615","主题类目","","","3"),
    MAC_620("620","出版制作","","","3"),
    MAC_660("660","地区代码","","","3"),
    MAC_661("661","年代代码","","","3"),
    MAC_670("670","关系标引","","","3"),
    MAC_675("675","国际分类","","","3"),
    MAC_676("676","杜威分类","","","3"),
    MAC_680("680","ＬＣＣ","","","3"),
    MAC_686("686","其它分类","","","3"),
    MAC_690("690","中图分类","1","","3"),
    MAC_692("692","科图分类","","","3"),
    MAC_700("700","人名主要","","","3"),
    MAC_701("701","人名等同","1","","3"),
    MAC_702("702","人名次要","","","3"),
    MAC_710("710","团体主要","","","3"),
    MAC_711("711","团体等同","","","3"),
    MAC_712("712","团体次要","","","3"),
    MAC_720("720","家族主要","","","3"),
    MAC_721("721","家族等同","","","3"),
    MAC_722("722","家族次要","","","3"),
    MAC_730("730","名称责任","","","3"),
    MAC_801("801","记录来源","1","1","3"),
    MAC_802("802","ISDS中心","","","3"),
    MAC_830("830","编目注释","","","3"),
    MAC_856("856","电子检索","","","3"),
    MAC_905("905","馆藏信息","","","3"),
    MAC_909("909","现刊收登","","","3"),
    MAC_920("920","期刊分类","","","3"),
    MAC_985("985","条码地址","","","3"),
    MAC_989("989","修改人员","","","3"),
    MAC_992("992","订购序号","","","3"),
    MAC_993("993","图书来源","","","3"),
    MAC_994("994","版本情况","","","3"),
    MAC_995("995","经费来源","","","3"),
    MAC_996("996","预订数据","","","3"),
    MAC_997("997","验收数据","","","3");


    // 成员变量
    private String name;//名称
    private String tag;//tag
    private String temp;//是否是模板
    private String nnull;//是否必填
    private String  ftype;//加个字段类型 1为leader  2为ControlField 3为datafield

    // 多加两个字段
    private String periTemp;//是否为期刊模板
    private String perNull;//是否为期刊必填


    private static Map<String, Map<String, Object>> marcmap = new HashMap<>();
    private static Map<String,Map<String, Object>> tempmarc = new HashMap<>();//保存模板数据信息

    // 构造方法
      EnumMarcInfo(String tag, String name, String temp, String nnull, String ftype ) {
        this.name = name;
        this.tag = tag;
        this.temp = temp;
        this.nnull = nnull;
        this.ftype = ftype;
    }
    // 根据tag得到name
    public static String getName(String tag) {
        for (EnumMarcInfo c : EnumMarcInfo.values()) {
            if (c.tag.equals(tag)) {
                return c.name;
            }
        }
        return null;
    }
    static {
        for (EnumMarcInfo c : EnumMarcInfo.values()) {
            Map<String, Object> mapinfo = new HashMap<>();
            mapinfo.put("mainfiled", c);//主字段
            mapinfo.put("subfiled", EnumMarcSubfileInfo.getAllsub(c.tag));//子字段
            EnumMarcInfo.marcmap.put(c.tag, mapinfo);
            //mapinfo.clear();
            if (c.temp.equals("1")) {
                Map<String, Object> mapinfo1 = new HashMap<>();
                mapinfo1.put("mainfiled", c);//模板主字段
                mapinfo1.put("subfiled", EnumMarcSubfileInfo.getTempsub(c.tag) );//模板字段子字段
                EnumMarcInfo.tempmarc.put(c.tag,mapinfo1);
            }
        }
    }
    //根据tag得到主字段信息不包括子字段信息
    public static Map<String,Object> getMainNotSubFiled(String tag){
        Map<String, Object> mainmap = new HashMap<>();
        Map m = (Map) EnumMarcInfo.marcmap.get(tag);
        if (m != null && m.get("mainfiled") != null) {
            mainmap.put("mainfiled",m.get("mainfiled"));
        }
        return mainmap;
    }
    //根据tag得到主字段信息包括子字段信息
    public static Map<String,Object> getMainSubFiled(String tag){
        Map<String, Object> mainmap = new HashMap<>();
        Map<String, Object> m = EnumMarcInfo.marcmap.get(tag);
        if (m != null) {
            mainmap.putAll(m);
        }
        return mainmap;
    }
    public static Map<String,Map<String,Object>> getTempmarc(){
        Map<String, Map<String,Object>> temp = new HashMap<>();
        temp.putAll(tempmarc);
        return temp;
    }
    //根据tag模糊搜索马克主字段枚举信息
    public static List<Map> getMarcByLikeTag(String tag){
        List<Map> listmap = new ArrayList<>();
        for (Object o : marcmap.keySet()) {
            if(o.toString().contains(tag)){
                Map<String,String> mapinfo = new HashMap<>();
                Map map = (Map) marcmap.get(o.toString());
                EnumMarcInfo mainfiled = (EnumMarcInfo) map.get("mainfiled");
                mapinfo.put("name", mainfiled.getName());
                mapinfo.put("tag",mainfiled.getTag());
                mapinfo.put("temp",mainfiled.getTemp());
                mapinfo.put("require",mainfiled.getNnull());
                listmap.add(mapinfo);
            }
        }
        return listmap;
    }

    public String getName() {
        return name;
    }

    public void setName(String name) {
        this.name = name;
    }

    public String getTag() {
        return tag;
    }

    public String getTemp() {
        return temp;
    }

    public String getNnull() {
        return nnull;
    }

    public String getFtype() {
        return ftype;
    }



}
